{
  "DEFAULT": "Não foi possível processar o seu pedido. Por favor tente novamente.",
  "AB03": "Liquidação da transação interrompida devido a timeout no SPI.",
  "AB09": "Transação interrompida devido a erro no participante do usuário recebedor.",
  "AB11": "Timeout do participante emissor da ordem de pagamento.",
  "AC03": "Pagamento rejeitado pelo PSP do recebedor.",
  "AC06": "Conta transacional do usuário recebedor encontra-se bloqueada.",
  "AC07": "Número da conta transacional do usuário recebedor encerrada.",
  "AC14": "Tipo incorreto para a conta transacional do usuário recebedor.",
  "AG03": "Tipo de transação não é suportado/autorizado na conta transacional do usuário recebedor. Exemplo: transferência para conta salário.",
  "AG12": "Não é permitida ordem de pagamento/devolução no SPI cujos recursos sejam transferidos de uma conta transacional para outra em uma mesma instituição participante ou entre participantes que utilizem o serviço de liquidação de um mesmo participante liquidante no SPI (booktransfer).",
  "AG13": "Não é permitido devolver a devolução de um pagamento instantâneo.",
  "AGNT": "Participante direto não é liquidante do participante do usuário pagador.",
  "AM01": "Ordem de pagamento instantâneo com valor zero.",
  "AM02": "Ordem de pagamento/devolução em valor que faz superar o limite permitido para o tipo de conta transacional creditada.",
  "AM04": "Saldo insuficiente na conta PI do participante do usuário pagador.",
  "AM09": "Devolução de pagamento em valor que faz superar o valor da ordem de pagamento instantâneo correspondente.",
  "AM12": "Divergência entre a somatória dos valores do bloco 'valorDaTarifaOuDinheiroOuCompra' e o campo 'valor'.",
  "AM18": "Quantidade de transações inválida.",
  "BE01": "CPF/CNPJ do usuário recebedor não é consistente com o titular da conta transacional especificada.",
  "BE05": "CNPJ do iniciador de pagamento não se encontra cadastrado no arranjo Pix.",
  "BE17": "QR Code rejeitado pelo participante do usuário recebedor.",
  "CH11": "CPF/CNPJ do usuário recebedor incorreto.",
  "CH16": "Preenchimento do conteúdo da mensagem incorreto ou incompatível com as regras de negócio.",
  "DS04": "Ordem rejeitada pelo participante do usuário recebedor.",
  "DS0G": "Participante que assinou a mensagem não é autorizado a realizar a operação na conta PI debitada. No caso em que o participante que assinou a mensagem não é o titular da conta PI debitada nem é o liquidante no SPI do participante do usuário pagador.",
  "DS24": "Ordem rejeitada por extrapolação do tempo decorrido entre o envio da pain.013 e o recebimento da pacs.008 correspondente pelo participante do usuário recebedor.",
  "DS27": "Participante não se encontra cadastrado ou ainda não iniciou a operação no SPI.",
  "DT02": "Data e Hora do envio da mensagem inválida.",
  "DT05": "Transação extrapola o prazo máximo para devolução de pagamento instantâneo regulamentado pelo arranjo Pix.",
  "ED05": "Erro no processamento do pagamento instantâneo (erro genérico).",
  "FF07": "Inconsistência entre a finalidade da transação e o preenchimento do bloco elementos Structured <Strd>.",
  "FF08": "Identificador da operação mal formatado.",
  "MD01": "ISPB do participante facilitador de serviço Pix Saque ou Pix Troco inexistente.",
  "RC09": "ISPB do participante do usuário pagador inválido ou inexistente.",
  "RC10": "ISPB do participante do usuário recebedor inválido ou inexistente.",
  "RR04": "Ordem de pagamento em que o usuário pagador é sancionado por resolução do Conselho de Segurança das Nações Unidas (CSNU). Nos casos em que o usuário recebedor for o sancionado, a ordem de pagamento não deve ser",
  "SL02": "A transação referenciada na mensagem de devolução (pacs.004) original não está relacionada aos serviços de Pix Saque ou Pix Troco."
}