{
    "PIX_DEPOSIT_RECEIVED_ACCOUNT_NOT_FOUND": "Depósito recebido para uma conta inexistente ou desativada.",
    "DEFAULT": "Não foi possível processar o seu pedido. Por favor tente novamente.",
    "FORBIDDEN": "Acesso negado.",
    "UNAUTHORIZED": "Acesso negado.",
    "MISSING_DATA": "Dados obrigatórios necessários: {}.",
    "USER_NOT_FOUND": "Usuário não encontrado.",
    "BANK_NOT_FOUND": "Banco não encontrado.",
    "ONBOARDING_NOT_FOUND": "Onboarding não encontrado.",
    "NOT_ENOUGH_FUNDS": "Não há saldo disponível.",
    "NOT_ENOUGH_LIMIT": "Não há limite disponível.",
    "VALUE_IS_ABOVE_MAX_AMOUNT_LIMIT": "O valor está acima do limite máximo. Por favor verifique e tente novamente.",
    "VALUE_IS_ABOVE_MIN_AMOUNT_LIMIT": "O valor está abaixo do limite mínimo. Por favor verifique e tente novamente.",
    "PAYMENT_BETWEEN_SAME_WALLET": "Pagamento realizado entre a mesma carteira. Por favor verifique e tente novamente.",
    "OPERATION_NOT_FOUND": "Operação não encontrada. Por favor verifique e tente novamente.",
    "CURRENCY_NOT_FOUND": "Moeda não encontrada. Por favor verifique e tente novamente.",
    "CURRENCY_NOT_ACTIVE": "Moeda inativa. Por favor verifique e tente novamente.",
    "WALLET_NOT_ACTIVE": "Carteira inativa. Por favor verifique e tente novamente.",
    "WALLET_NOT_FOUND": "Carteira não encontrada. Por favor verifique e tente novamente.",
    "WALLET_ACCOUNT_NOT_ACTIVE": "Dados de conta inativa. Por favor verifique e tente novamente.",
    "WALLET_ACCOUNT_NOT_FOUND": "Dados da conta não encontrados. Por favor verifique seu cadastro e tente novamente.",
    "PAYMENT_NOT_SETTLED": "Pagamento não foi liquidado. Por favor tente novamente.",
    "PAYMENT_INVALID_DATE": "Data não permitida ou acima de 3 meses, selecione uma data válida e tente novamente.",
    "DECODED_PIX_ACCOUNT_NOT_FOUND": "Dados da conta não encontrados. Por favor tente novamente.",
    "DECODED_PIX_ACCOUNT_INVALID_STATE": "Dados da conta não processados. Por favor tente novamente.",
    "QR_CODE_STATIC_NOT_FOUND": "QR Code estático não encontrado. Por favor tente novamente.",
    "QR_CODE_NOT_FOUND": "Dados do QR Code não encontrados. Por favor tente novamente.",
    "DECODED_QR_CODE_INVALID_STATE": "Dados do QR Code não processados. Por favor tente novamente.",
    "DECODED_PIX_KEY_NOT_FOUND": "Dados da chave não encontrados. Por favor tente novamente.",
    "DECODED_PIX_KEY_INVALID_STATE": "Dados da chave não processados. Por favor tente novamente.",
    "DECODED_QR_CODE_INVALID_TYPE": "Tipo do QR Code inválido para operação. Por favor verifique e tente novamente.",
    "PAYMENT_VALUE_IS_NOT_POSITIVE": "Valor do pagamento deverá ser maior que 0.",
    "PSP_ERROR": "Não foi possível processar o seu pagamento. Por favor tente novamente.",
    "PSP_OFFLINE": "Não foi possível processar o seu pagamento. Por favor tente novamente.",
    "PAYMENT_VALUE_EXCEEDS_PERIOD_LIMIT": "Valor do pagamento excedeu o limite para o horário.",
    "PAYMENT_NOT_FOUND": "Pagamento não encontrado.",
    "PAYMENT_INVALID_STATE": "Status do pagamento inválido para operação. Por favor tente novamente.",
    "PIX_DEVOLUTION_NOT_FOUND": "Devolução não encontrada.",
    "PIX_DEVOLUTION_INVALID_STATE": "Status da devolução inválido para operação. Por favor tente novamente.",
    "PIX_DEVOLUTION_RECEIVED_NOT_FOUND": "Devolução recebida não encontrada.",
    "PIX_DEVOLUTION_RECEIVED_INVALID_STATE": "Status da devolução recebida inválido para operação. Por favor tente novamente.",
    "PIX_DEVOLUTION_RECEIVED_ACCOUNT_NOT_FOUND": "Conta recebida na devolução não foi encontrada. Por favor tente novamente com uma conta válida.",
    "PIX_DEPOSIT_RECEIVED_NOT_FOUND_EXCEPTION": "Depósito não encontrado.",
    "PIX_DEPOSIT_RECEIVED_INVALID_STATE": "Status do depósito inválido para operação. Por favor tente novamente.",
    "PIX_DEVOLUTION_MAX_NUMBER": "Número máximo de devoluções realizadas.",
    "PIX_DEVOLUTION_AMOUNT_OVERFLOW": "Valor a devolver maior que o valor do depósito.",
    "PIX_DEVOLUTION_NOT_SETTLED": "Devolução não foi liquidada. Por favor tente novamente.",
    "DECODED_QR_CODE_EXPIRED": "Não é possível realizar o pagamento, QR Code está expirado.",
    "PIX_PAYMENT_ZRO_ACCOUNT_NOT_EXISTS": "Conta destino não encontrada. Por favor verifique e tente novamente.",
    "PIX_DEPOSIT_ZRO_ACCOUNT_NOT_EXISTS": "Conta destino não encontrada. Por favor verifique e tente novamente.",
    "PIX_DEPOSIT_RECEIVED_BANK_NOT_ALLOWED_EXCEPTION": "Não é possível receber depósitos com destino a outros bancos.",
    "PIX_DEVOLUTION_RECEIVED_BANK_NOT_ALLOWED_EXCEPTION": "Não é possível receber devoluções com destino a outros bancos.",
    "PIX_DEPOSIT_EXPIRED_DEVOLUTION_TIME": "Não é possível realizar a devolução desse depósito porque acabou o prazo."
  }